<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"f16a711c2a3bd9609e0b550d913a5c30974df9fb5b42eec1cac05e9cb1ebd3f9","plan_job_ref":"Job Run Terraform plan in staging #71 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11280975385","plan_out_hash":"f2a21426b29399e9f049ad81de42553dfcc5a15a67765eef7636ec80dc4a5d1d","plan_hash":"02bc05df46424051ada29a213eb0611f4a5fdd4ca0c07ed88060a05c286c9e5c","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/staging__
<details>
<summary>Plan: 3 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.app_space.cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
!~      asgs                     = [
-           "71d5aa70-fdce-46fa-8494-aabdb8cae381",
        ]
+       delete_recursive_allowed = true
        id                       = "7137716e-43e5-4d59-8234-599ecaf58a6e"
        name                     = "rahearn"
#        (10 unchanged attributes hidden)
    }

  # module.app_space.cloudfoundry_space_asgs.running_security_groups will be created
+   resource "cloudfoundry_space_asgs" "running_security_groups" {
+       id           = (known after apply)
+       running_asgs = [
+           "71d5aa70-fdce-46fa-8494-aabdb8cae381",
        ]
+       space        = "7137716e-43e5-4d59-8234-599ecaf58a6e"
+       staging_asgs = (known after apply)
    }

  # module.app_space.cloudfoundry_space_users.space_permissions will be created
+   resource "cloudfoundry_space_users" "space_permissions" {
+       auditors   = (known after apply)
+       developers = [
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
+           "9ffca92e-54bd-412f-913f-8f6271a1d0ac",
        ]
+       force      = false
+       id         = (known after apply)
+       managers   = [
+           "6ca5b315-3eec-4e1f-a2a7-d22c3fe3508b",
+           "9ffca92e-54bd-412f-913f-8f6271a1d0ac",
        ]
+       space      = "7137716e-43e5-4d59-8234-599ecaf58a6e"
    }

  # module.egress_space.cloudfoundry_space_asgs.running_security_groups will be created
+   resource "cloudfoundry_space_asgs" "running_security_groups" {
+       id           = (known after apply)
+       running_asgs = [
+           "c70d6061-4da3-4cbb-bd8e-c9982a5e8b22",
        ]
+       space        = "ceca9558-8003-4b85-a596-db5da07fe35a"
+       staging_asgs = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #71](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/11280975385)